// 1)
// // Чем отличается Bootstrap 5 от 3 и 4 версии

//Bootstrap 5 переключился на JavaScript вместо j-Query 

// 2)
// // Что такое Bootstrap? разьясни своими словами

//это бесплатный интерфейс который включает в себя шаблоны html и css а так же плагины javascript и помогает работать с адаптивным веб дизайном

// 3)
// // Что такое адаптивный веб дизайн?

// это дизвйн сайта который автоматически настраиваивается чтобы хорошо выглядеть на всех устройствах

// 4)
// // Зачем использовать стоит использовать Bootstrap?

// простое использование, адаптивный дизайн и возможность использоватся с разными браузерами

// 5)
// // Какими 2мя методами можно подключить Bootstrap?

// Включить из CDN
// Загрузить с сайта 


// 6)
// // В чем преимущество CDN?

// ускоренная загрузка

// 7)
// // Для чего в Bootstrap используется JavaScript?

// для различных компонентов

// 8)
// // На какие 2 вида подразделяются контейнеры в Bootstrap?

// Класс .container
// Класс .container-fluid


// 9)
// // Сколько пикселей будет фиксированный контейнер если ширина меньше 576px

// 100%

// 10) 
// // Сколько пикселей будет фиксированный контейнер если ширина больше или равно 576px

// 540px

// 11) 
// // Сколько пикселей будет фиксированный контейнер если больше или равно 768px

// 720px

// 12) 
// // Сколько пикселей будет фиксированный контейнер если больше или равно 992px

// 960px

// 13) 
// // Сколько пикселей будет фиксированный контейнер если больше или равно 1200px

// 1140px

// 14) 
// // Сколько пикселей будет фиксированный контейнер если больше или равно 1400px

// 1320

// 15) 
// // Сколько пикселей занимает Жидкий контейнер?

// всегда охватывает весь экран

// 16) 
// // Какие размеры есть у фиксированного контейнера перечисли
// // Пример: .container-sm

// .container-md
// .container-lg
// .container-xl
// .container-xxl
